soap/test/resources/tttRequestFromOriginalCodeEclipse.xml

f9c
<?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"><soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing"><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" soapenv:mustUnderstand="true"><wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:ns16="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns17="http://docs.oasis-open.org/ws-sx/ws-secureconversation/200512" wsu:Id="_1"><wsu:Created>2013-01-31T23:27:54Z</wsu:Created><wsu:Expires>2013-01-31T23:32:54Z</wsu:Expires></wsu:Timestamp><saml:Assertion xmlns:saml="urn:oasis:names:tc:SAML:2.0:assertion" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" ID="_942F56CE9CE96BAAB613596748743391" IssueInstant="2013-01-31T23:27:54.339Z" Version="2.0" xsi:type="saml:AssertionType"><saml:Issuer Format="urn:oasis:names:tc:SAML:1.1:nameid-format:X509SubjectName">CN=lambdaMan@nist.gov,O=Nist Test Lab,L=Gaithersburg,ST=Maryland,C=US</saml:Issuer><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1" /><ds:Reference URI="#_942F56CE9CE96BAAB613596748743391"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature" /><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" /><ds:DigestValue>znEcH7wNYtH6+4wRiR0k+D28ZUg=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>MphM3ax5Ai39iXQLdk6+1Pwce2YlKZq8DEKeRVF5BZE94/O7lQY8CH/Hoyb973DBmgZvU7CsYgSf
tZClnXaLYMAfz1BowHbippxVblJgn1463iaG2vQ8tHxL7nk9615/WF3UhzvM5VsHr1Bc07R8coYE
0x2bZQvxHfS9SPhIpNBceiPOur7eg6ppclY8lwGdVBjZbkHpWSVoCAI3QWn7UgVw9PEcXaso0mSe
dP/+ixTwWTe9q0ajYK8ZODXDBde2+FgPbrDu+eCtkE7O8xfRI/QbXjfhe2pnkJ00dBxu8to7l0O+
62MCTUIrpH2hpOoMct7WcfJX+HakXDWREMLGJg==</ds:SignatureValue><ds:KeyInfo><ds:KeyValue><ds:RSAKeyValue><ds:Modulus>lYGm36g0r4b/oqHbIfubfylKC1fIQUAT2w0IgnwPFqmpKvrvpz8JebHLVTsADxrX8j3C+FyUdC3n
BFTihya8s9VmW3OfdX3e/XuQcpIqCA3uloUCVsNdEw8+H5fBuGdCYKVnZa38CvqZOajkMqHHt1MS
/hZqEJKk1S0xKdLSy4ZiGlU/q7LMheWkJSQ0NSxsx9G5y9qAWKIH4G0HjwBU1Fu6FV+YcBCwCDqy
PHL/aymm4RYB3zBTiXIBw7b1MeTYFFRmBF59ATklpAyXuxhBytIarwmZFzpZbnuiEB8ucJRJM72k
xtBs26hHmM1CHCFXpxZ5PoG9DVWftBebsBLNew==</ds:Modulus><ds:Exponent>AQAB</ds:Exponent></ds:RSAKeyValue></ds:KeyValue></ds:KeyInfo></ds:Signature><saml:Subject><saml:NameID Format="urn:oasis:names:tc:SAML:1.1:nameid-format:X509SubjectName">uid=joe,ou=people,ou=saml-demo,o=example.com</saml:NameID><saml:SubjectConfirmation Method="urn:oasis:names:tc:SAML:2.0:cm:holder-of-key"><saml:SubjectConfirmationData xsi:type="saml:KeyInfoConfirmationDataType"><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:KeyValue><ds:RSAKeyValue><ds:Modulus>lYGm36g0r4b/oqHbIfubfylKC1fIQUAT2w0IgnwPFqmpKvrvpz8JebHLVTsADxrX8j3C+FyUdC3n
BFTihya8s9VmW3OfdX3e/XuQcpIqCA3uloUCVsNdEw8+H5fBuGdCYKVnZa38CvqZOajkMqHHt1MS
/hZqEJKk1S0xKdLSy4ZiGlU/q7LMheWkJSQ0NSxsx9G5y9qAWKIH4G0HjwBU1Fu6FV+YcBCwCDqy
PHL/aymm4RYB3zBTiXIBw7b1MeTYFFRmBF59ATklpAyXuxhBytIarwmZFzpZbnuiEB8ucJRJM72k
xtBs26hHmM1CHCFXpxZ5PoG9DVWftBebsBLNew==</ds:Modulus><ds:Exponent>AQAB</ds:Exponent></ds:RSAKeyValue></ds:KeyValue></ds:KeyInfo></saml:SubjectConfirmationData></saml:SubjectConfirmation></saml:Subject><saml:AuthnStatement AuthnInstant="2013-01-31T23:27:54.341Z" SessionIndex="12345"><saml:SubjectLocality Address="158.147.185.10" DNSName="ssa.gov" /><saml:AuthnContext><saml:AuthnContextClassRef>urn:oasis:names:tc:SAML:2.0:ac:classes:X509</saml:AuthnContextClassRef></saml:AuthnContext></saml:AuthnStatement><saml:AttributeStatement><saml:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:subject-id" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri"><saml:Attr
f9c
ibuteValue xmlns:xs="http://www.w3.org/2001/XMLSchema" xsi:type="xs:string">uid=joe,ou=people,ou=saml-demo,o=example.com</saml:AttributeValue></saml:Attribute></saml:AttributeStatement><saml:AttributeStatement><saml:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:organization" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri"><saml:AttributeValue xmlns:xs="http://www.w3.org/2001/XMLSchema" xsi:type="xs:string">Social Security Administration</saml:AttributeValue></saml:Attribute></saml:AttributeStatement><saml:AttributeStatement><saml:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:organization-id" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri"><saml:AttributeValue xmlns:xs="http://www.w3.org/2001/XMLSchema" xsi:type="xs:string">urn:oid:2.2</saml:AttributeValue></saml:Attribute></saml:AttributeStatement><saml:AttributeStatement><saml:Attribute Name="urn:nhin:names:saml:homeCommunityId" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri"><saml:AttributeValue xmlns:xs="http://www.w3.org/2001/XMLSchema" xsi:type="xs:string">urn:oid:2.2</saml:AttributeValue></saml:Attribute></saml:AttributeStatement><saml:AttributeStatement><saml:Attribute Name="urn:oasis:names:tc:xacml:2.0:subject:role" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri"><saml:AttributeValue xmlns:xs="http://www.w3.org/2001/XMLSchema" xsi:type="xs:string">2.16.840.1.113883.3.18.6.1.15</saml:AttributeValue></saml:Attribute></saml:AttributeStatement><saml:AttributeStatement><saml:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:purposeofuse" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri"><saml:AttributeValue xmlns:xs="http://www.w3.org/2001/XMLSchema" xsi:type="xs:string">2.16.840.1.113883.3.184.6.1</saml:AttributeValue></saml:Attribute></saml:AttributeStatement><saml:AttributeStatement><saml:Attribute Name="urn:oasis:names:tc:xacml:2.0:resource:resource-id" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri"><saml:AttributeValue xmlns:xs="http://www.w3.org/2001/XMLSchema" xsi:type="xs:string">D123401^^^&amp;1.1&amp;ISO</saml:AttributeValue></saml:Attribute></saml:AttributeStatement><saml:AuthzDecisionStatement Decision="Permit" Resource="https://nhinri2c23.aegis.net:443/RespondingGateway_Query_Service/DocQuery"><saml:Action Namespace="urn:oasis:names:tc:SAML:1.0:action:rwedc">Execute</saml:Action><saml:Evidence><saml:Assertion ID="_942F56CE9CE96BAAB613596748743472" IssueInstant="2013-01-31T23:27:54.347Z" Version="2.0" xsi:type="saml:AssertionType"><saml:Issuer Format="urn:oasis:names:tc:SAML:1.1:nameid-format:X509SubjectName">CN=lambdaMan@nist.gov,O=Nist Test Lab,L=Gaithersburg,ST=Maryland,C=US</saml:Issuer><saml:Conditions NotBefore="2013-01-31T23:27:54.347Z" NotOnOrAfter="2013-01-31T23:32:54.347Z" /><saml:AttributeStatement><saml:Attribute Name="InstanceAccessConsentPolicy" NameFormat="http://www.hhs.gov/healthit/nhin"><saml:AttributeValue xmlns:xs="http://www.w3.org/2001/XMLSchema" xsi:type="xs:string">urn:oid:2.16.840.1.113883.3.184.6.1.2222</saml:AttributeValue></saml:Attribute></saml:AttributeStatement></saml:Assertion></saml:Evidence></saml:AuthzDecisionStatement></saml:Assertion><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="_2"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><exc14n:InclusiveNamespaces xmlns:exc14n="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="wsse soapenv" /></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1" /><ds:Reference URI="#_1"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature" /><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" /><ds:DigestValue>Jg3xZNHPSkKmRBoSAQtUdqgp8Vo=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>al/eVranDGFkQ54y/6BtsqHcRXAUfACcLHuzFvZ/Spt5wSImTS
8e4
sELeK5yMU0qnw0hVgONpJWN3Mm
/HR5MbJb6CdVSdQ4W/8WRNKhYeJG1OF3PQdzXRhF7JAg3G+EEyDAL980VXPOson8pwMKwEQWWz9V
Ma4V7IZ03BgFQ0xk+A/2GAKiFx+FrAfSKolpunJlse9ILdXufWIrOpOcTBV7t0V/2EFl6ZvMSel8
5y9/1N8AWmPljwbSCgOfjIyx97EnX/ZNBEq5L7gcAD+oZBXJGkoiJTzync92wGSgV8FfunmoRHK9
68VEdVBPQm2vAnbPmGq2KEe9OtXDmEcsiwEllQ==</ds:SignatureValue><ds:KeyInfo><wsse:SecurityTokenReference xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd" wsse11:TokenType="http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.1#SAMLV2.0"><wsse:KeyIdentifier ValueType="http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.1#SAMLID">_942F56CE9CE96BAAB613596748743391</wsse:KeyIdentifier></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security><wsa:To soapenv:mustUnderstand="true">https://192.168.188.128:9892/Gateway/DocumentQuery/2_0/NhinService/RespondingGateway_Query_Service/DocQuery</wsa:To><wsa:MessageID soapenv:mustUnderstand="true">urn:uuid:EE33A35FFBB358B45B1359674874566</wsa:MessageID><wsa:Action soapenv:mustUnderstand="true">urn:ihe:iti:2007:CrossGatewayQuery</wsa:Action></soapenv:Header><soapenv:Body><query:AdhocQueryRequest xmlns:query="urn:oasis:names:tc:ebxml-regrep:xsd:query:3.0" xmlns="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0" xmlns:rs="urn:oasis:names:tc:ebxml-regrep:xsd:rs:3.0" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
                    <query:ResponseOption returnComposedObjects="true" returnType="ObjectRef" />
                    <AdhocQuery id="urn:uuid:14d4debf-8f97-4251-9a74-a90016b0af0d" home="1.1">
                        <Slot name="$XDSDocumentEntryPatientId">
                            <ValueList>
                                <Value>'D123401^^^&amp;1.1&amp;ISO'</Value>
                            </ValueList>
                        </Slot>
                        <Slot name="$XDSDocumentEntryStatus">
                            <ValueList>
                                <Value>('urn:oasis:names:tc:ebxml-regrep:StatusType:Approved', 'urn:oasis:names:tc:ebxml-regrep:StatusType:Deprecated')</Value>
                            </ValueList>
                        </Slot>
                    </AdhocQuery>
                </query:AdhocQueryRequest></soapenv:Body></soapenv:Envelope>
0